In [61]:
sales = [
    {"date":"2026-01-02","city":"Warszawa","category":"Kawa","product":"Espresso","qty":3,"price":12.0,"payment":"card"},
    {"date":"2026-01-02","city":"Warszawa","category":"Kawa","product":"Latte","qty":2,"price":16.0,"payment":"cash"},
    {"date":"2026-01-03","city":"Kraków","category":"Herbata","product":"Earl Grey","qty":1,"price":11.0,"payment":"card"},
    {"date":"2026-01-03","city":"Gdańsk","category":"Kawa","product":"Cappuccino","qty":2,"price":15.0,"payment":"card"},
    {"date":"2026-01-04","city":"Kraków","category":"Ciasto","product":"Sernik","qty":1,"price":18.0,"payment":"cash"},
    {"date":"2026-01-04","city":"Warszawa","category":"Ciasto","product":"Brownie","qty":2,"price":14.0,"payment":"card"},
    {"date":"2026-01-05","city":"Gdańsk","category":"Herbata","product":"Matcha","qty":1,"price":19.0,"payment":"card"},
    {"date":"2026-01-05","city":"Warszawa","category":"Kawa","product":"Latte","qty":1,"price":16.0,"payment":"card"},
    {"date":"2026-01-06","city":"Kraków","category":"Kawa","product":"Espresso","qty":2,"price":12.0,"payment":"cash"},
    {"date":"2026-01-06","city":"Gdańsk","category":"Ciasto","product":"Sernik","qty":1,"price":18.0,"payment":"card"},
]

import pandas as pd
df = pd.DataFrame(sales)
df.describe()

             qty      price
count  10.000000  10.000000
mean    1.600000  15.100000
std     0.699206   2.806738
min     1.000000  11.000000
25%     1.000000  12.500000
50%     1.500000  15.500000
75%     2.000000  17.500000
max     3.000000  19.000000

In [50]:
df.info()
df.head()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      10 non-null     str
 1   city      10 non-null     str
 2   category  10 non-null     str
 3   product   10 non-null     str
 4   qty       10 non-null     int64
 5   price     10 non-null     float64
 6   payment   10 non-null     str
dtypes: float64(1), int64(1), str(5)
memory usage: 692.0 bytes

         date      city category     product  qty  price payment
0  2026-01-02  Warszawa     Kawa    Espresso    3   12.0    card
1  2026-01-02  Warszawa     Kawa       Latte    2   16.0    cash
2  2026-01-03    Kraków  Herbata   Earl Grey    1   11.0    card
3  2026-01-03    Gdańsk     Kawa  Cappuccino    2   15.0    card
4  2026-01-04    Kraków   Ciasto      Sernik    1   18.0    cash

In [48]:
len(df)

10

In [82]:
len(df.columns)

#df.insert(loc=7, column='value', value=df['qty'] * df['price'])
df.head()

df.sort_values(by='value', ascending=False)

df[df['city'] == 'Warszawa']
df[(df['category'] == "Kawa") & (df['payment'] == "card")]

         date      city category     product  qty  price payment  value
0  2026-01-02  Warszawa     Kawa    Espresso    3   12.0    card   36.0
3  2026-01-03    Gdańsk     Kawa  Cappuccino    2   15.0    card   30.0
7  2026-01-05  Warszawa     Kawa       Latte    1   16.0    card   16.0